In [23]:
import sqlite3
import pandas as pd
import matplotlib.pyplot as plt

In [24]:
con = sqlite3.connect('db.sqlite3')
df = pd.read_sql_query("SELECT * FROM sqlite_master", con)

In [25]:
df

,type,name,tbl_name,rootpage,sql
0,table,django_migrations,django_migrations,2,"CREATE TABLE ""django_migrations"" (""id"" integer..."
1,table,sqlite_sequence,sqlite_sequence,3,"CREATE TABLE sqlite_sequence(name,seq)"
2,table,auth_group,auth_group,9,"CREATE TABLE ""auth_group"" (""id"" integer NOT NU..."
3,index,sqlite_autoindex_auth_group_1,auth_group,10,None
4,table,auth_group_permissions,auth_group_permissions,11,"CREATE TABLE ""auth_group_permissions"" (""id"" in..."
5,table,auth_user_groups,auth_user_groups,15,"CREATE TABLE ""auth_user_groups"" (""id"" integer ..."
6,table,auth_user_user_permissions,auth_user_user_permissions,16,"CREATE TABLE ""auth_user_user_permissions"" (""id..."
7,index,auth_group_permissions_group_id_permission_id_...,auth_group_permissions,20,CREATE UNIQUE INDEX auth_group_permissions_gro...
8,index,auth_group_permissions_group_id_b120cbf9,auth_group_permissions,21,"CREATE INDEX ""auth_group_permissions_group_id_..."
9,index,auth_group_permissions_permission_id_84c5c92e,auth_group_permissions,23,"CREATE INDEX ""auth_group_permissions_permissio..."
10,index,auth_user_groups_user_id_group_id_94350c0c_uniq,auth_user_groups,24,CREATE UNIQUE INDEX auth_user_groups_user_id_g...
11,index,auth_user_groups_user_id_6a12ed8b,auth_user_groups,25,"CREATE INDEX ""auth_user_groups_user_id_6a12ed8..."
12,index,auth_user_groups_group_id_97559544,auth_user_groups,26,"CREATE INDEX ""auth_user_groups_group_id_975595..."
13,index,auth_user_user_permissions_user_id_permission_...,auth_user_user_permissions,27,CREATE UNIQUE INDEX auth_user_user_permissions...
14,index,auth_user_user_permissions_user_id_a95ead1b,auth_user_user_permissions,29,"CREATE INDEX ""auth_user_user_permissions_user_..."
15,index,auth_user_user_permissions_permission_id_1fbb5f2c,auth_user_user_permissions,30,"CREATE INDEX ""auth_user_user_permissions_permi..."
16,table,django_admin_log,django_admin_log,35,"CREATE TABLE ""django_admin_log"" (""id"" integer ..."
17,index,django_admin_log_content_type_id_c4bce8eb,django_admin_log,31,"CREATE INDEX ""django_admin_log_content_type_id..."
18,index,django_admin_log_user_id_c564eba6,django_admin_log,33,"CREATE INDEX ""django_admin_log_user_id_c564eba..."
19,table,django_content_type,django_content_type,5,"CREATE TABLE ""django_content_type"" (""id"" integ..."
20,index,django_content_type_app_label_model_76bd3d3b_uniq,django_content_type,4,CREATE UNIQUE INDEX django_content_type_app_la...
21,table,auth_permission,auth_permission,34,"CREATE TABLE ""auth_permission"" (""id"" integer N..."
22,index,auth_permission_content_type_id_codename_01ab3...,auth_permission,6,CREATE UNIQUE INDEX auth_permission_content_ty...
23,index,auth_permission_content_type_id_2f476e4b,auth_permission,18,"CREATE INDEX ""auth_permission_content_type_id_..."
24,table,auth_user,auth_user,12,"CREATE TABLE ""auth_user"" (""id"" integer NOT NUL..."
25,index,sqlite_autoindex_auth_user_1,auth_user,13,None
26,table,myapp_member,myapp_member,19,"CREATE TABLE ""myapp_member"" (""id"" integer NOT ..."
27,table,django_session,django_session,42,"CREATE TABLE ""django_session"" (""session_key"" v..."
28,index,sqlite_autoindex_django_session_1,django_session,43,None
29,index,django_session_expire_date_a5c62663,django_session,44,"CREATE INDEX ""django_session_expire_date_a5c62..."
30,table,myapp_room,myapp_room,55,"CREATE TABLE ""myapp_room"" (""id"" integer NOT NU..."
31,table,myapp_rent,myapp_rent,384,"CREATE TABLE ""myapp_rent"" (""id"" integer NOT NU..."
32,index,myapp_rent_member_id_c328ad0a,myapp_rent,37,"CREATE INDEX ""myapp_rent_member_id_c328ad0a"" O..."
33,index,myapp_rent_room_id_e0d974f9,myapp_rent,193,"CREATE INDEX ""myapp_rent_room_id_e0d974f9"" ON ..."

In [26]:
df_member = pd.read_sql_query("SELECT * FROM myapp_member", con)
df_room = pd.read_sql_query("SELECT * FROM myapp_room", con)
df_rent = pd.read_sql_query("SELECT * FROM myapp_rent", con, parse_dates=['start','stop'])

In [27]:
df_member.head(1)

   id            name mobile
0   1  Oscar Williams

In [28]:
df_room.head(1)

   id number  hour_price  isavailable
0   6    101         105            1

In [29]:
df_rent.tail(1)

        id                      start stop  member_id  room_id  cost
3426  3809 2018-10-01 18:01:18.462109  NaT         79       10   NaN

In [31]:
df=df_rent.merge(df_member, how='inner', left_on='member_id', right_on='id')\
    .merge(df_room, left_on='room_id', right_on='id')

df.drop(columns=['id_y', 'id', 'mobile'],inplace=True)
df.rename(columns={'id_x':'rent_id'},inplace=True)
df.head()

,rent_id,start,stop,member_id,room_id,cost,name,number,hour_price,isavailable
0,383,2018-05-09 08:01:18.462109,2018-05-09 09:01:18.462109,48,7,100.0,Thomas Thomas,102,100,1
1,1839,2018-07-10 12:01:18.462109,2018-07-10 13:01:18.462109,48,7,100.0,Thomas Thomas,102,100,1
2,2676,2018-08-16 01:01:18.462109,2018-08-16 02:01:18.462109,48,7,100.0,Thomas Thomas,102,100,1
3,3044,2018-08-31 02:01:18.462109,2018-08-31 03:01:18.462109,48,7,100.0,Thomas Thomas,102,100,1
4,3105,2018-09-02 13:01:18.462109,2018-09-02 16:01:18.462109,48,7,300.0,Thomas Thomas,102,100,1

In [32]:
#Q1 Who did spend most money for renting?
df.groupby('name')\
    .agg({'cost':'sum'})\
    .sort_values(by='cost',ascending=False)\
    .head(1)

                cost
name
Oscar Smith  15116.0

In [33]:
#Q2 Which room does make the most amount of income?

df.groupby('number')\
    .agg({'cost':'sum'})\
    .sort_values(by='cost',ascending=False)\
    .head(1)

            cost
number
105     269645.0

In [34]:
#Q3 How many time Jack Jones rent the room?
df.query('name=="Jack Jones"').groupby('name').agg({'rent_id':'count'})

            rent_id
name
Jack Jones       35

In [35]:
#Q4 What are the rooms rented by Claire Taylor?
df.query('name=="Claire Taylor"').groupby('number').agg({'rent_id':'count'})

        rent_id
number
101           4
102          12
103           4
104          10
105           5

In [42]:
#Q5 what is the total income of ALL rooms in June? 
#Between 1st June 2018(inclusive) and 30th June 2018(inclusive), (use return date).
from datetime import datetime
start = datetime.strptime( "2018-06-01T00:00:00", "%Y-%m-%dT%H:%M:%S" )
stop = datetime.strptime( "2018-06-30T23:59:59", "%Y-%m-%dT%H:%M:%S" )
df[ (start<=df.stop) & (df.stop<stop) ]\
    .groupby('number').agg({'cost':'sum'})

           cost
number
101     30135.0
102     30400.0
103     48450.0
104     37700.0
105     49551.0

In [75]:
#Q7 Find members that have total rent time exactly 8 hours in June?
df2=df[ (start<=df.stop) & (df.stop<stop) ]
df2['hours']=(df2.stop-df2.start).apply(lambda x: x.seconds//3600)
df2.groupby('name').agg({'hours':'sum'}).query('hours==8')

/home/wasit/gitlab/cs459_django2018/exam/env/lib/python3.6/site-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  after removing the cwd from sys.path.

                hours
name
James Jones         8
Oscar Johnson       8
William Thomas      8

In [65]:
df

,rent_id,start,stop,member_id,room_id,cost,name,number,hour_price,isavailable,hours,seconds
0,383,2018-05-09 08:01:18.462109,2018-05-09 09:01:18.462109,48,7,100.0,Thomas Thomas,102,100,1,1.0,3600.0
1,1839,2018-07-10 12:01:18.462109,2018-07-10 13:01:18.462109,48,7,100.0,Thomas Thomas,102,100,1,1.0,3600.0
2,2676,2018-08-16 01:01:18.462109,2018-08-16 02:01:18.462109,48,7,100.0,Thomas Thomas,102,100,1,1.0,3600.0
3,3044,2018-08-31 02:01:18.462109,2018-08-31 03:01:18.462109,48,7,100.0,Thomas Thomas,102,100,1,1.0,3600.0
4,3105,2018-09-02 13:01:18.462109,2018-09-02 16:01:18.462109,48,7,300.0,Thomas Thomas,102,100,1,3.0,10800.0
5,3662,2018-09-25 07:01:18.462109,2018-09-25 09:01:18.462109,48,7,200.0,Thomas Thomas,102,100,1,2.0,7200.0
6,388,2018-05-09 13:01:18.462109,2018-05-09 14:01:18.462109,1,7,100.0,Oscar Williams,102,100,1,1.0,3600.0
7,428,2018-05-11 09:01:18.462109,2018-05-11 10:01:18.462109,1,7,100.0,Oscar Williams,102,100,1,1.0,3600.0
8,1397,2018-06-21 13:01:18.462109,2018-06-21 16:01:18.462109,1,7,300.0,Oscar Williams,102,100,1,3.0,10800.0
9,1520,2018-06-27 14:01:18.462109,2018-06-27 18:01:18.462109,1,7,400.0,Oscar Williams,102,100,1,4.0,14400.0
10,1853,2018-07-11 02:01:18.462109,2018-07-11 05:01:18.462109,1,7,300.0,Oscar Williams,102,100,1,3.0,10800.0
11,2834,2018-08-22 02:01:18.462109,2018-08-22 04:01:18.462109,1,7,200.0,Oscar Williams,102,100,1,2.0,7200.0
12,3689,2018-09-26 15:01:18.462109,2018-09-26 17:01:18.462109,1,7,200.0,Oscar Williams,102,100,1,2.0,7200.0
13,460,2018-05-12 20:01:18.462109,2018-05-13 00:01:18.462109,67,7,400.0,Oliver Brown,102,100,1,4.0,14400.0
14,592,2018-05-18 15:01:18.462109,2018-05-18 17:01:18.462109,67,7,200.0,Oliver Brown,102,100,1,2.0,7200.0
15,1192,2018-06-13 05:01:18.462109,2018-06-13 07:01:18.462109,67,7,200.0,Oliver Brown,102,100,1,2.0,7200.0
16,1210,2018-06-14 02:01:18.462109,2018-06-14 03:01:18.462109,67,7,100.0,Oliver Brown,102,100,1,1.0,3600.0
17,1282,2018-06-17 00:01:18.462109,2018-06-17 03:01:18.462109,67,7,300.0,Oliver Brown,102,100,1,3.0,10800.0
18,2756,2018-08-18 21:01:18.462109,2018-08-18 22:01:18.462109,67,7,100.0,Oliver Brown,102,100,1,1.0,3600.0
19,3502,2018-09-18 17:01:18.462109,2018-09-18 19:01:18.462109,67,7,200.0,Oliver Brown,102,100,1,2.0,7200.0
20,386,2018-05-09 10:01:18.462109,2018-05-09 12:01:18.462109,18,7,200.0,Harry Davies,102,100,1,2.0,7200.0
21,798,2018-05-27 01:01:18.462109,2018-05-27 03:01:18.462109,18,7,200.0,Harry Davies,102,100,1,2.0,7200.0
22,1474,2018-06-25 11:01:18.462109,2018-06-25 12:01:18.462109,18,7,100.0,Harry Davies,102,100,1,1.0,3600.0
23,2129,2018-07-22 21:01:18.462109,2018-07-23 00:01:18.462109,18,7,300.0,Harry Davies,102,100,1,3.0,10800.0
24,2254,2018-07-28 12:01:18.462109,2018-07-28 15:01:18.462109,18,7,300.0,Harry Davies,102,100,1,3.0,10800.0
25,2540,2018-08-10 01:01:18.462109,2018-08-10 04:01:18.462109,18,7,300.0,Harry Davies,102,100,1,3.0,10800.0
26,3071,2018-08-31 22:01:18.462109,2018-09-01 00:01:18.462109,18,7,200.0,Harry Davies,102,100,1,2.0,7200.0
27,3225,2018-09-07 07:01:18.462109,2018-09-07 08:01:18.462109,18,7,100.0,Harry Davies,102,100,1,1.0,3600.0
28,457,2018-05-12 17:01:18.462109,2018-05-12 19:01:18.462109,86,7,200.0,Jacob Taylor,102,100,1,2.0,7200.0
29,954,2018-06-02 17:01:18.462109,2018-06-02 18:01:18.462109,86,7,100.0,Jacob Taylor,102,100,1,1.0,3600.0
...,...,...,...,...,...,...,...,...,...,...,...,...
3397,1104,2018-06-09 05:01:18.462109,2018-06-09 06:01:18.462109,74,9,130.0,George Smith,104,130,1,1.0,3600.0
3398,1582,2018-06-30 00:01:18.462109,2018-06-30 02:01:18.462109,74,9,260.0,George Smith,104,130,1,2.0,7200.0
3399,1643,2018-07-02 14:01:18.462109,2018-07-02 16:01:18.462109,74,9,260.0,George Smith,104,130,1,2.0,7200.0
3400,1686,2018-07-04 12:01:18.462109,2018-07-04 13:01:18.462109,74,9,130.0,George Smith,104,130,1,1.0,3600.0
3401,1891,2018-07-12 23:01:18.462109,2018-07-13 00:01:18.462109,74,9,130.0,George Smith,104,130,1,1.0,3600.0
3402,2905,2018-08-25 14:01:18.462109,2018-08-25 16:01:18.462109,74,9,260.0,George Smith,104,130,1,2.0,7200.0
3403,3553,2018-09-20 19:01:18.462109,2018-09-20 22:01:18.462109,74,9,390.0,George Smith,104,130,1,3.0,10800.0
3404,668,2018-05-21 15:01:18.462109,2018-05-21 17:01:18.462109,71,9,260.0,James Johnson,104,130,1,2.0,7200.0
3405,1503,2018-06-26 20:01:18.462109,2018-06-27 02:01:18.462109,71,9,780.0,James Johnson,104,130,1,6.0,21600.0
3406,1613,2018-07-01 09:01:18.462109,2018-07-01 10:01:18.462109,71,9,130.0,James Johnson,104,130,1,1.0,3600.0
3407,2036,2018-07-19 05:01:18.462109,2018-07-19 06:01:18.462109,69,9,130.0,Thomas Brown,104,130,1,1.0,3600.0
3408,2150,2018-07-23 20:01:18.462109,2018-07-23 23:01:18.462109,69,9,390.0,Thomas Brown,104,130,1,3.0,10800.0
3409,2644,2018-08-14 09:01:18.462109,2018-08-14 10:01:18.462109,69,9,130.0,Thomas Brown,104,130,1,1.0,3600.0
3410,2715,2018-08-17 12:01:18.462109,2018-08-17 14:01:18.462109,69,9,260.0,Thomas Brown,104,130,1,2.0,7200.0
3411,2839,2018-08-22 07:01:18.462109,2018-08-22 10:01:18.462109,69,9,390.0,Thomas Brown,104,130,1,3.0,10800.0
3412,3377,2018-09-13 10:01:18.462109,2018-09-13 14:01:18.462109,69,9,520.0,Thomas Brown,104,130,1,4.0,14400.0
3413,3525,2018-09-19 11:01:18.462109,2018-09-19 12:01:18.462109,69,9,130.0,Thomas Brown,104,130,1,1.0,3600.0
3414,1469,2018-06-25 05:01:18.462109,2018-06-25 06:01:18.462109,62,9,130.0,Jack Smith,104,130,1,1.0,3600.0
3415,2264,2018-07-29 01:01:18.462109,2018-07-29 05:01:18.462109,62,9,520.0,Jack Smith,104,130,1,4.0,14400.0
3416,3750,2018-09-29 01:01:18.462109,2018-09-29 02:01:18.462109,62,9,130.0,Jack Smith,104,130,1,1.0,3600.0
3417,756,2018-05-25 10:01:18.462109,2018-05-25 11:01:18.462109,25,9,130.0,James Taylor,104,130,1,1.0,3600.0
3418,1427,2018-06-22 19:01:18.462109,2018-06-22 20:01:18.462109,25,9,130.0,James Taylor,104,130,1,1.0,3600.0
3419,1790,2018-07-08 05:01:18.462109,2018-07-08 08:01:18.462109,25,9,390.0,James Taylor,104,130,1,3.0,10800.0
3420,1957,2018-07-15 18:01:18.462109,2018-07-15 19:01:18.462109,25,9,130.0,James Taylor,104,130,1,1.0,3600.0
3421,2572,2018-08-11 04:01:18.462109,2018-08-11 05:01:18.462109,25,9,130.0,James Taylor,104,130,1,1.0,3600.0
3422,2662,2018-08-15 08:01:18.462109,2018-08-15 10:01:18.462109,25,9,260.0,James Taylor,104,130,1,2.0,7200.0
3423,2729,2018-08-17 23:01:18.462109,2018-08-18 00:01:18.462109,25,9,130.0,James Taylor,104,130,1,1.0,3600.0
3424,3410,2018-09-14 16:01:18.462109,2018-09-14 18:01:18.462109,25,9,260.0,James Taylor,104,130,1,2.0,7200.0
3425,3436,2018-09-15 14:01:18.462109,2018-09-15 16:01:18.462109,25,9,260.0,James Taylor,104,130,1,2.0,7200.0
3426,3788,2018-09-30 17:01:18.462109,2018-09-30 19:01:18.462109,25,9,260.0,James Taylor,104,130,1,2.0,7200.0

In [63]:
df.iloc[1]

rent_id                              1839
start          2018-07-10 12:01:18.462109
stop           2018-07-10 13:01:18.462109
member_id                              48
room_id                                 7
cost                                  100
name                        Thomas Thomas
number                                102
hour_price                            100
isavailable                             1
hours                                   1
seconds                              3600
Name: 1, dtype: object

In [64]:
df.head(2)

,rent_id,start,stop,member_id,room_id,cost,name,number,hour_price,isavailable,hours,seconds
0,383,2018-05-09 08:01:18.462109,2018-05-09 09:01:18.462109,48,7,100.0,Thomas Thomas,102,100,1,1.0,3600.0
1,1839,2018-07-10 12:01:18.462109,2018-07-10 13:01:18.462109,48,7,100.0,Thomas Thomas,102,100,1,1.0,3600.0